<script>

</script>

<div class="conteiner">
    <img class="img" src="src/assets/images.jpeg" alt="">
    
    <div class="content">
        <h1>
            ☕ Кав'ярня "Кофе Мішка" у Луцьку: Новини та Анонси
        </h1>
        <p>
            Кав'ярня "Кофе Мішка", відома своїм затишком та фірмовими напоями, продовжує дивувати своїх відвідувачів. Ми зібрали найсвіжіші (вигадані) анонси, які варто знати!
        </p>
        <h2>
            🐻 Представлено Оновлене Зимове Меню
        </h2>
        <p>
            З 10 грудня "Кофе Мішка" запрошує скуштувати нове сезонне меню. Головні хіти: <strong>"Медовий Латте з Прянощами"</strong> та унікальний <strong>"Гарячий Шоколад з Чілі та Апельсином"</strong>. Також додано нову лінійку авторських десертів, включаючи "Торт-сніговик" з кокосовим кремом.
        </p>
        <h2>
            🎤 Вечори Живої Музики Повертаються!
        </h2>
        <p>
            Щоп'ятниці та щосуботи "Кофе Мішка" відновлює традицію "Акустичних Вечорів". Запрошуємо насолодитися ароматною кавою під мелодійні звуки саксофона та гітари. Початок о 19:00. Вхід вільний, але рекомендуємо бронювати столик заздалегідь через великий попит.
        </p>
        <h2>
            🎁 Акція: "Щаслива Година Мішки"
        </h2>
        <p>
            З понеділка по четвер, з 14:00 до 16:00, діє спеціальна пропозиція: при покупці будь-якого напою розміру L, ви отримуєте **другий напій зі знижкою 50%**. Чудова нагода провести каво-брейк з друзями!
        </p>
    </div>
</div>
    
<style>
    p{
        font-size: 16px;
        margin:  5px 0 ;
    }
    h1{
        font-size: 44px;
    }
    h2{
        font-size: 27px;
    }
    .conteiner{
        margin: 40px 0px;
        width: 75%;
            display: flex;
    }
    .img{
        width: 50%;
        height: 700px;
        border-radius: 30px 0 0 30px;
    }
    .content{

        border-radius: 0 30px 30px 0;
        background-color: rgb(228, 209, 176);
        padding: 20px 40px 20px 70px;
    }
    @media (max-width: 1830px) {
        p{
            font-size: 13px
        }
        h1{
            font-size: 33px;
        }
        h2{
            font-size: 20px;
        }
    }
    @media (max-width: 1310px) {
        p{
            font-size: 10px
        }
        h1{
            font-size: 25px;
        }
        h2{
            font-size: 15px;
        }
        .content{
            padding: 10px 15px 10px 20px;
        }
    }
    @media (max-width: 710px) {
        p{
            font-size: 10px
        }
        h1{
            font-size: 25px;
            line-height: 28px;
        }
        h2{
            font-size: 15px;
        }
        .conteiner{
            flex-direction: column;
        }
        .img{
            width: 100%;
            height: 400px;
            object-fit: cover;
            border-radius: 30px 30px 0 0;
        }
        .content{
            border-radius:  0 0 30px 30px;

        }
    }
</style>